package com.sqb.blog.util.respcode;

/**
 * 返回码
 * @author elvis.xu
 * @since 2015-6-5
 */
public interface RespCode {

	/** 成功 */
	String RES_0000 = "0000";

	/** 参数{0}格式错误: {1} */
	String RES_0010 = "0010";
	/** 参数{0}必须为有效的枚举值 */
	String RES_0011 = "0011";
	/** 参数{0}不能为空 */
	String RES_0012 = "0012";
	/** 参数{0}取值不在范围内 */
	String RES_0013 = "0013";
	/** 查询不到记录: {0}={1} */
	String RES_0014 = "0014";

	/** 请先登录 */
	String RES_0100 = "0100";
	/** TOKEN无效，请重新登录 */
	String RES_0101 = "0101";

	/** 无效的订单状态 */
	String RES_0200 = "0200";
	/** 订单状态流转异常 */
	String RES_0201 = "0201";
	/** 当前订单状态不可变更 */
	String RES_0202 = "0202";
	/** 订单状态暂不可用 */
	String RES_0203 = "0203";
	/** 订单状态版本已失效 */
	String RES_0204 = "0204";

	/** 订单不存在: {0} */
	String RES_0220 = "0220";
	/** 订单状态异常, 不能支付： {0} */
	String RES_0221 = "0221";

	/** 当前订单状态不能回写: {0} */
	String RES_0250 = "0250";

	/** {0}不可变更状态: from={1}, to={2} */
	String RES_0297 = "0297";
	/** {0}不可变更状态到: {1} */
	String RES_0298 = "0298";
	/** {0}并发操作: orig={1}, cur={2} */
	String RES_0299 = "0299";

	/** 好药师商品不存在: {0}={1} */
	String RES_0300 = "0300";
	/** 好药师商品库存不足: {0}={1} */
	String RES_0301 = "0301";
	/** 好药师商品信息已变更: {0}={1} */
	String RES_0302 = "0302";
	
	/** 运费校验失败: param={0},server={1} */
	String RES_0320 = "0320";
	
	/** 超出系统限制，如有疑问请联系客服。 */
	String RES_9950 = "9950";
	/** 亲，您的手速太快了，慢点儿！ */
	String RES_9960 = "9960";

	/** 未知应用 */
	String RES_9970 = "9970";
	/** 未知应用版本 */
	String RES_9971 = "9971";
	/** 亲，您的应用版本太低了哦，请升级最新版本体验更多功能吧！ */
	String RES_9972 = "9972";

	/** 内部错误 */
	String RES_9999 = "9999";

}
